package com.example.toporetstinkoff24

interface JokeRepository {
    fun getJokes(): List<Joke>
}

class JokeRepositoryImpl : JokeRepository {
    override fun getJokes(): List<Joke> {
        return listOf(
            Joke(
                1,
                "Тест",
                "??????????????????????????????",
                "БАБАББАБАБАББАБАББАБАБАБАБАБУБАУБАБУБАУБАУБАБУАБУБАУБАУБАБУБАУББУАБУБАБАУБУАБАБАУБУАБАУБУАБУАБАУБУБАУБУАБУБУАБАУБУАБАУБУАБУА"
            ),
            Joke(2, "Наука", "Почему ученые не доверяют атомам?", "Потому что они все составляют."),
            Joke(3, "Математика", "Почему 6 боится 7?", "Потому что 7 8 (съел) 9."),
            Joke(4, "Животные", "Почему коты не любят компьютеры?", "Потому что они боятся мышей."),
            Joke(
                5,
                "Спорт",
                "Почему футболисты не могут играть в прятки?",
                "Потому что они всегда попадают в офсайд."
            ),
            Joke(
                6,
                "Еда",
                "Почему ананас никогда не выигрывает в покер?",
                "Потому что он всегда показывает свои колоды."
            ),
            Joke(
                7,
                "Отношения",
                "Почему отношения как код?",
                "Если не компилируются, надо искать баги."
            ),
            Joke(
                8,
                "Путешествия",
                "Что говорит один чемодан другому?",
                "Давай, у нас много мест, куда поехать!"
            ),
            Joke(
                9, "История", "Почему история всегда скучна?", "Потому что она никогда не меняется!"
            ),
            Joke(
                10,
                "Музыка",
                "Почему музыканты всегда берут с собой лестницу?",
                "Чтобы достать высокие ноты!"
            )
        )
    }
}